open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_scale_rotate.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_scale_rotate.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP typed helper for the v3.1.1.9 hardware scale and rotator
 * engines.  NuttX has no generic upper-half for these operations; an
 * existing framebuffer/video owner must supply the buffers and call this
 * helper from normal thread context.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <common/bk_err.h>
#include <driver/hw_scale.h>
#include <driver/rott_driver.h>

#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>

#include <arch/chip/bk7258_scale_rotate.h>

#define BK7258_SCALE_ROTATE_DEFAULT_TIMEOUT_MS 1000
#define BK7258_SCALE_ROTATE_MAX_DIM            1280
#define BK7258_SCALE_ROTATE_MIN_BLOCK_PIXELS  1
#define BK7258_SCALE_ROTATE_MAX_BLOCK_PIXELS  4800

/* v3.1.1.9 exposes Scale1 but leaves scale_set_write_burst(HW_SCALE1)
 * unimplemented.  Its generated BK7258 register description identifies
 * REG_0x10[11:0] as the write-burst threshold.  Program that one missing
 * field here after the SDK reset, without modifying the immutable SDK. */

#define BK7258_SCALE1_WRITE_THRESHOLD_REG 0x480e0040u
#define BK7258_SCALE1_WRITE_THRESHOLD_MASK 0x00000fffu

/* These are the non-zero bookkeeping values used by the SDK's official
 * BLOCK_SCALE examples.  The common scale ISR reads line_cycle and applies a
 * modulo before it branches on FRAME_SCALE, even though FRAME_SCALE address
 * programming does not use block addresses.  Keep both fields representable
 * and safe for that shared ISR path; never encode src_height in line_cycle. */

#define BK7258_SCALE_ROTATE_FRAME_LINE_CYCLE 16
#define BK7258_SCALE_ROTATE_FRAME_LINE_MASK  0x1f

/* The immutable bundle does not export sys_driver.h.  These are the
 * minimal v3.1.1.9 ABI declarations used to correct the rotator's default
 * IRQ target.  CPU1 is the NuttX AP core and CPU2 is the SDK's default
 * rotator target.  The ROTT bit is bit 27 of group 2 in bk7258_ap/sys_types.h.
 * Unlike the enable call, group2_disable returns the previous register and
 * is therefore not an errno/status result. */

extern int32_t sys_drv_core_intr_group2_enable(uint32_t core_id,
                                               uint32_t param);
extern int32_t sys_drv_core_intr_group2_disable(uint32_t core_id,
                                                uint32_t param);

#define BK7258_SCALE_ROTATE_CPU1_CORE_ID       1u
#define BK7258_SCALE_ROTATE_CPU2_CORE_ID       2u
#define BK7258_SCALE_ROTATE_ROTT_IRQ_BIT       (1u << 27)

struct bk7258_scale_rotate_s
{
  mutex_t lock;
  sem_t completion;
  enum bk7258_scale_rotate_engine_e engine;
  spinlock_t state_lock; /* protects state shared with the peripheral ISR */
  bool operation_active;
  bool completion_done;
  int completion_result;
  bool initialized;
  bool faulted;
  bool interrupts_enabled;
  bool completion_isr_registered;
  bool error_isr_registered;
  bool driver_owned;
  bool memory_owned;
  bool rotator_irq_cpu1;
};

static struct bk7258_scale_rotate_s g_bk7258_scale_rotate =
{
  .lock = NXMUTEX_INITIALIZER,
  .completion = SEM_INITIALIZER(0),
  .state_lock = SP_UNLOCKED,
};

static int bk7258_scale_rotate_sdk_error(bk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
        return -EINVAL;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_NO_DEV:
      case BK_ERR_NOT_FOUND:
      case BK_ERR_NOT_INIT:
      case BK_ERR_HW_SCALE_NOT_INIT:
      case BK_ERR_ROTT_NOT_INIT:
        return -ENODEV;

      default:
        return -EIO;
    }
}

static int bk7258_scale_rotate_route_rott_to_cpu1(void)
{
  int32_t ret;

  /* bk_rott_int_enable() unconditionally enables the CPU2 target in the
   * v3.1.1.9 SDK.  Disable's return value is the old enable register, not a
   * status code, so only the CPU1 enable result is checked. */

  (void)sys_drv_core_intr_group2_disable(
    BK7258_SCALE_ROTATE_CPU2_CORE_ID,
    BK7258_SCALE_ROTATE_ROTT_IRQ_BIT);
  ret = sys_drv_core_intr_group2_enable(
    BK7258_SCALE_ROTATE_CPU1_CORE_ID,
    BK7258_SCALE_ROTATE_ROTT_IRQ_BIT);
  if (ret != 0)
    {
      (void)sys_drv_core_intr_group2_disable(
        BK7258_SCALE_ROTATE_CPU1_CORE_ID,
        BK7258_SCALE_ROTATE_ROTT_IRQ_BIT);
      return -EIO;
    }

  return 0;
}

static void bk7258_scale_rotate_route_rott_from_cpu1(void)
{
  /* The disable API returns the previous enable register, not status. */

  (void)sys_drv_core_intr_group2_disable(
    BK7258_SCALE_ROTATE_CPU1_CORE_ID,
    BK7258_SCALE_ROTATE_ROTT_IRQ_BIT);
}

static bool bk7258_scale_rotate_valid_engine(
  enum bk7258_scale_rotate_engine_e engine)
{
  return engine == BK7258_SCALE_ROTATE_SCALE0 ||
         engine == BK7258_SCALE_ROTATE_SCALE1 ||
         engine == BK7258_SCALE_ROTATE_ROTATOR;
}

static bool bk7258_scale_rotate_is_scale(
  enum bk7258_scale_rotate_engine_e engine)
{
  return engine == BK7258_SCALE_ROTATE_SCALE0 ||
         engine == BK7258_SCALE_ROTATE_SCALE1;
}

static scale_id_t bk7258_scale_rotate_scale_id(
  enum bk7258_scale_rotate_engine_e engine)
{
  return engine == BK7258_SCALE_ROTATE_SCALE1 ? HW_SCALE1 : HW_SCALE0;
}

static void bk7258_scale_rotate_configure_scale1_burst(uint16_t width)
{
  volatile uint32_t *reg =
    (volatile uint32_t *)(uintptr_t)BK7258_SCALE1_WRITE_THRESHOLD_REG;
  uint32_t threshold;
  uint32_t value;

  if ((width & 127) == 0)
    {
      threshold = 64;
    }
  else if ((width & 63) == 0)
    {
      threshold = 32;
    }
  else if ((width & 31) == 0)
    {
      threshold = 16;
    }
  else
    {
      /* Public requests are already constrained to multiples of 16. */

      threshold = 8;
    }

  value = *reg;
  value &= ~BK7258_SCALE1_WRITE_THRESHOLD_MASK;
  value |= threshold;
  *reg = value;
  __asm volatile ("dsb sy" ::: "memory");
}

