open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_scale_rotate.c
static int bk7258_scale_rotate_pixel_bytes(
  enum bk7258_scale_rotate_format_e format)
{
  switch (format)
    {
      case BK7258_SCALE_ROTATE_RGB565_LE:
      case BK7258_SCALE_ROTATE_RGB565:
      case BK7258_SCALE_ROTATE_YUYV:
      case BK7258_SCALE_ROTATE_UYVY:
      case BK7258_SCALE_ROTATE_YYUV:
      case BK7258_SCALE_ROTATE_UVYY:
      case BK7258_SCALE_ROTATE_VUYY:
        return 2;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_scale_rotate_map_scale_format(
  enum bk7258_scale_rotate_format_e format, pixel_format_t *mapped)
{
  if (mapped == NULL)
    {
      return -EINVAL;
    }

  switch (format)
    {
      case BK7258_SCALE_ROTATE_RGB565:
        *mapped = PIXEL_FMT_RGB565;
        return 0;

      case BK7258_SCALE_ROTATE_YUYV:
        *mapped = PIXEL_FMT_YUYV;
        return 0;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_scale_rotate_map_rotate_format(
  enum bk7258_scale_rotate_format_e format, pixel_format_t *mapped)
{
  if (mapped == NULL)
    {
      return -EINVAL;
    }

  switch (format)
    {
      case BK7258_SCALE_ROTATE_RGB565_LE:
        *mapped = PIXEL_FMT_RGB565_LE;
        return 0;

      case BK7258_SCALE_ROTATE_RGB565:
        *mapped = PIXEL_FMT_RGB565;
        return 0;

      case BK7258_SCALE_ROTATE_YUYV:
        *mapped = PIXEL_FMT_YUYV;
        return 0;

      case BK7258_SCALE_ROTATE_UYVY:
        *mapped = PIXEL_FMT_UYVY;
        return 0;

      case BK7258_SCALE_ROTATE_YYUV:
        *mapped = PIXEL_FMT_YYUV;
        return 0;

      case BK7258_SCALE_ROTATE_UVYY:
        *mapped = PIXEL_FMT_UVYY;
        return 0;

      case BK7258_SCALE_ROTATE_VUYY:
        *mapped = PIXEL_FMT_VUYY;
        return 0;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_scale_rotate_map_angle(
  enum bk7258_scale_rotate_angle_e angle, media_rotate_t *mapped)
{
  if (mapped == NULL)
    {
      return -EINVAL;
    }

  switch (angle)
    {
      case BK7258_SCALE_ROTATE_NONE:
        *mapped = ROTATE_NONE;
        return 0;

      case BK7258_SCALE_ROTATE_90:
        *mapped = ROTATE_90;
        return 0;

      case BK7258_SCALE_ROTATE_270:
        *mapped = ROTATE_270;
        return 0;

      case BK7258_SCALE_ROTATE_180:
      default:
        return -ENOTSUP;
    }
}

static int bk7258_scale_rotate_map_input_flow(
  enum bk7258_scale_rotate_input_flow_e flow,
  rott_input_data_flow_t *mapped)
{
  if (mapped == NULL)
    {
      return -EINVAL;
    }

  switch (flow)
    {
      case BK7258_SCALE_ROTATE_INPUT_NORMAL:
        *mapped = ROTT_INPUT_NORMAL;
        return 0;

      case BK7258_SCALE_ROTATE_INPUT_REVERSE_BYTE:
        *mapped = ROTT_INPUT_REVESE_BYTE_BY_BYTE;
        return 0;

      case BK7258_SCALE_ROTATE_INPUT_REVERSE_HALFWORD:
        *mapped = ROTT_INPUT_REVESE_HALFWORD_BY_HALFWORD;
        return 0;

      default:
        return -EINVAL;
    }
}

static int bk7258_scale_rotate_map_output_flow(
  enum bk7258_scale_rotate_output_flow_e flow,
  rott_output_data_flow_t *mapped)
{
  if (mapped == NULL)
    {
      return -EINVAL;
    }

  switch (flow)
    {
      case BK7258_SCALE_ROTATE_OUTPUT_NORMAL:
        *mapped = ROTT_OUTPUT_NORMAL;
        return 0;

      case BK7258_SCALE_ROTATE_OUTPUT_REVERSE_HALFWORD:
        *mapped = ROTT_OUTPUT_REVESE_HALFWORD_BY_HALFWORD;
        return 0;

      default:
        return -EINVAL;
    }
}

static int bk7258_scale_rotate_validate_buffer(FAR const void *buffer,
                                               size_t length)
{
  uint64_t base;

  if (buffer == NULL || length == 0)
    {
      return -EINVAL;
    }

  base = (uintptr_t)buffer;
  if (base > UINT32_MAX || (uint64_t)length - 1 > UINT32_MAX - base)
    {
      return -EOVERFLOW;
    }

  return 0;
}

static bool bk7258_scale_rotate_ranges_overlap(FAR const void *left,
                                               size_t left_size,
                                               FAR const void *right,
                                               size_t right_size)
{
  uint64_t left_start = (uintptr_t)left;
  uint64_t right_start = (uintptr_t)right;
  uint64_t left_end = left_start + left_size;
  uint64_t right_end = right_start + right_size;

  return left_start < right_end && right_start < left_end;
}

static int bk7258_scale_rotate_timeout(uint32_t timeout_ms,
                                       FAR clock_t *ticks)
{
  uint64_t value;

  if (ticks == NULL)
    {
      return -EINVAL;
    }

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_SCALE_ROTATE_DEFAULT_TIMEOUT_MS;
    }

  value = ((uint64_t)timeout_ms * CLK_TCK + 999) / 1000;
  if (value == 0)
    {
      value = 1;
    }

  if (value > (uint64_t)INT_MAX)
    {
      return -ERANGE;
    }

  *ticks = (clock_t)value;
  return 0;
}

/* Both SDK drivers call their registered completion callback directly from
 * the peripheral ISR.  These callbacks only publish a result under the
 * ISR-safe state lock and post a semaphore; all locking, timeout recovery
 * and buffer ownership remain in the caller's thread context. */

static void bk7258_scale_rotate_publish_completion(
  FAR struct bk7258_scale_rotate_s *priv, bool scale, int result)
{
  irqstate_t flags;
  bool post = false;

  if (priv != &g_bk7258_scale_rotate)
    {
      return;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  if (priv->operation_active &&
      (scale ? bk7258_scale_rotate_is_scale(priv->engine) :
               priv->engine == BK7258_SCALE_ROTATE_ROTATOR))
    {
      priv->completion_result = result;
      priv->completion_done = true;
      priv->operation_active = false;
      post = true;
    }

  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (post)
    {
      (void)nxsem_post(&priv->completion);
    }
}

static void bk7258_scale_rotate_scale_isr(FAR void *arg)
{
  FAR struct bk7258_scale_rotate_s *priv = arg;

  bk7258_scale_rotate_publish_completion(priv, true, 0);
}

static void bk7258_scale_rotate_rotate_complete_isr(void)
{
  FAR struct bk7258_scale_rotate_s *priv = &g_bk7258_scale_rotate;

