open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_scale_rotate.c
  bk7258_scale_rotate_publish_completion(priv, false, 0);
}

static void bk7258_scale_rotate_rotate_error_isr(void)
{
  FAR struct bk7258_scale_rotate_s *priv = &g_bk7258_scale_rotate;

  bk7258_scale_rotate_publish_completion(priv, false, -EIO);
}

static int bk7258_scale_rotate_prepare_wait_locked(
  FAR struct bk7258_scale_rotate_s *priv, uint32_t timeout_ms,
  FAR clock_t *ticks)
{
  int ret;

  ret = bk7258_scale_rotate_timeout(timeout_ms, ticks);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxsem_reset(&priv->completion, 0);
  if (ret < 0)
    {
      return ret;
    }

  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

    priv->completion_result = -EIO;
    priv->completion_done = false;
    priv->operation_active = true;
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }

  return 0;
}

static int bk7258_scale_rotate_wait_locked(
  FAR struct bk7258_scale_rotate_s *priv, clock_t ticks)
{
  int ret;
  bool completed;
  bool need_reset;
  enum bk7258_scale_rotate_engine_e engine;
  irqstate_t flags;

  ret = nxsem_tickwait_uninterruptible(&priv->completion, ticks);

  flags = spin_lock_irqsave(&priv->state_lock);
  engine = priv->engine;
  completed = priv->completion_done;
  if (completed)
    {
      ret = priv->completion_result;
    }
  else if (ret >= 0)
    {
      /* A semaphore wake without a published callback violates the SDK
       * completion contract.  Treat it like a failed operation. */

      ret = -EIO;
    }

  priv->operation_active = false;
  priv->completion_done = false;
  need_reset = !completed;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (need_reset)
    {
      if (engine == BK7258_SCALE_ROTATE_ROTATOR)
        {
          (void)bk_rott_soft_reset();
        }
      else
        {
          (void)bk_hw_scale_stop(
            bk7258_scale_rotate_scale_id(engine));
        }

      /* The public APIs provide no bounded abort-and-join contract.  Poison
       * the owner after timeout so a possibly running DMA transfer cannot be
       * reused until the caller deinitializes it. */

      priv->faulted = true;
      return ret;
    }

  if (ret < 0)
    {
      priv->faulted = true;
    }

  return ret;
}

static int bk7258_scale_rotate_check(
  FAR struct bk7258_scale_rotate_s *priv,
  enum bk7258_scale_rotate_engine_e engine)
{
  if (priv != &g_bk7258_scale_rotate)
    {
      return -EINVAL;
    }

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  if (priv->engine != engine)
    {
      return -ENOTSUP;
    }

  if (priv->faulted)
    {
      return -EIO;
    }

  return 0;
}

static int bk7258_scale_rotate_init_scale_locked(
  FAR struct bk7258_scale_rotate_s *priv)
{
  scale_id_t id = bk7258_scale_rotate_scale_id(priv->engine);
  int ret;

  /* The v3.1.1.9 scale driver uses sys_drv_int_group2_enable() for Scale0/1;
   * its BK7258 sys_hal implementation writes CPU1's group-2 register. */

  ret = bk7258_scale_rotate_sdk_error(bk_hw_scale_driver_init(id));
  if (ret < 0)
    {
      /* The SDK may have allocated one of its records before reporting a
       * failed init.  Its deinit API intentionally does not free them.  If
       * that failure occurred after SDK PM/IRQ setup but before is_init was
       * set, the public SDK has no rollback API; mem_free is the only safe
       * cleanup available to this wrapper. */

      (void)bk_hw_scale_mem_free(id);
      return ret;
    }

  ret = bk7258_scale_rotate_sdk_error(
    bk_hw_scale_isr_register(id, bk7258_scale_rotate_scale_isr, priv));
  if (ret < 0)
    {
      (void)bk_hw_scale_driver_deinit(id);
      (void)bk_hw_scale_mem_free(id);
      return ret;
    }

  ret = bk7258_scale_rotate_sdk_error(bk_hw_scale_int_enable(id, true));
  if (ret < 0)
    {
      (void)bk_hw_scale_isr_unregister(id);
      (void)bk_hw_scale_driver_deinit(id);
      (void)bk_hw_scale_mem_free(id);
      return ret;
    }

  return 0;
}

static int bk7258_scale_rotate_init_rotate_locked(void)
{
  int ret;

  ret = bk7258_scale_rotate_sdk_error(bk_rott_driver_init());
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_scale_rotate_sdk_error(
    bk_rott_isr_register(ROTATE_COMPLETE_INT,
                         bk7258_scale_rotate_rotate_complete_isr));
  if (ret < 0)
    {
      (void)bk_rott_driver_deinit();
      return ret;
    }

  ret = bk7258_scale_rotate_sdk_error(
    bk_rott_isr_register(ROTATE_CFG_ERR_INT,
                         bk7258_scale_rotate_rotate_error_isr));
  if (ret < 0)
    {
      (void)bk_rott_isr_register(ROTATE_COMPLETE_INT, NULL);
      (void)bk_rott_driver_deinit();
      return ret;
    }

  ret = bk7258_scale_rotate_sdk_error(
    bk_rott_int_enable(ROTATE_COMPLETE_INT | ROTATE_CFG_ERR_INT, true));
  if (ret < 0)
    {
      (void)bk_rott_isr_register(ROTATE_COMPLETE_INT, NULL);
      (void)bk_rott_isr_register(ROTATE_CFG_ERR_INT, NULL);
      (void)bk_rott_driver_deinit();
      return ret;
    }

  ret = bk7258_scale_rotate_route_rott_to_cpu1();
  if (ret < 0)
    {
      (void)bk_rott_int_enable(ROTATE_COMPLETE_INT | ROTATE_CFG_ERR_INT,
                               false);
      (void)bk_rott_isr_register(ROTATE_COMPLETE_INT, NULL);
      (void)bk_rott_isr_register(ROTATE_CFG_ERR_INT, NULL);
      (void)bk_rott_driver_deinit();
      bk7258_scale_rotate_route_rott_from_cpu1();
      return ret;
    }

  return 0;
}

int bk7258_scale_rotate_initialize(
  FAR struct bk7258_scale_rotate_s **out,
  enum bk7258_scale_rotate_engine_e engine)
{
  FAR struct bk7258_scale_rotate_s *priv = &g_bk7258_scale_rotate;
  int ret;

  if (out == NULL || !bk7258_scale_rotate_valid_engine(engine))
    {
      return -EINVAL;
    }

  *out = NULL;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

    priv->engine = engine;
    priv->operation_active = false;
    priv->completion_done = false;
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }

