open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_scale_rotate.c
  priv->faulted = false;
  priv->rotator_irq_cpu1 = false;
  ret = bk7258_scale_rotate_is_scale(engine) ?
    bk7258_scale_rotate_init_scale_locked(priv) :
    bk7258_scale_rotate_init_rotate_locked();
  if (ret >= 0)
    {
      priv->initialized = true;
      priv->interrupts_enabled = true;
      priv->completion_isr_registered = true;
      priv->error_isr_registered =
        engine == BK7258_SCALE_ROTATE_ROTATOR;
      priv->driver_owned = true;
      priv->memory_owned = bk7258_scale_rotate_is_scale(engine);
      priv->rotator_irq_cpu1 = engine == BK7258_SCALE_ROTATE_ROTATOR;
      *out = priv;
    }
  else
    {
      irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

      priv->engine = BK7258_SCALE_ROTATE_SCALE0;
      priv->operation_active = false;
      priv->completion_done = false;
      priv->interrupts_enabled = false;
      priv->completion_isr_registered = false;
      priv->error_isr_registered = false;
      priv->driver_owned = false;
      priv->memory_owned = false;
      priv->rotator_irq_cpu1 = false;
      spin_unlock_irqrestore(&priv->state_lock, flags);
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_scale_rotate_uninitialize(
  FAR struct bk7258_scale_rotate_s *priv)
{
  int ret;
  int cleanup_ret;

  if (priv != &g_bk7258_scale_rotate)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  /* Stop accepting late ISR completions before unregistering callbacks. */

  priv->faulted = true;

  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

    priv->operation_active = false;
    priv->completion_done = false;
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }

  if (bk7258_scale_rotate_is_scale(priv->engine))
    {
      scale_id_t id = bk7258_scale_rotate_scale_id(priv->engine);

      ret = OK;
      if (priv->interrupts_enabled)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_hw_scale_int_enable(id, false));
          if (ret < 0)
            {
              goto out;
            }

          priv->interrupts_enabled = false;
        }

      if (priv->completion_isr_registered)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_hw_scale_isr_unregister(id));
          if (ret < 0)
            {
              goto out;
            }

          priv->completion_isr_registered = false;
        }

      if (priv->driver_owned)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_hw_scale_driver_deinit(id));
          if (ret < 0)
            {
              goto out;
            }

          priv->driver_owned = false;
        }

      cleanup_ret = OK;
      if (priv->memory_owned)
        {
          cleanup_ret = bk7258_scale_rotate_sdk_error(
            bk_hw_scale_mem_free(id));
          if (cleanup_ret < 0)
            {
              ret = cleanup_ret;
              goto out;
            }

          priv->memory_owned = false;
        }
    }
  else
    {
      ret = OK;
      if (priv->interrupts_enabled)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_rott_int_enable(ROTATE_COMPLETE_INT | ROTATE_CFG_ERR_INT,
                               false));
          if (ret < 0)
            {
              goto out;
            }

          priv->interrupts_enabled = false;
        }

      if (priv->completion_isr_registered)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_rott_isr_register(ROTATE_COMPLETE_INT, NULL));
          if (ret < 0)
            {
              goto out;
            }

          priv->completion_isr_registered = false;
        }

      if (priv->error_isr_registered)
        {
          ret = bk7258_scale_rotate_sdk_error(
            bk_rott_isr_register(ROTATE_CFG_ERR_INT, NULL));
          if (ret < 0)
            {
              goto out;
            }

          priv->error_isr_registered = false;
        }

      ret = bk7258_scale_rotate_sdk_error(bk_rott_soft_reset());
      if (ret < 0)
        {
          goto out;
        }

      if (priv->driver_owned)
        {
          ret = bk7258_scale_rotate_sdk_error(bk_rott_driver_deinit());
          if (ret < 0)
            {
              goto out;
            }

          priv->driver_owned = false;
        }

      if (priv->rotator_irq_cpu1)
        {
          bk7258_scale_rotate_route_rott_from_cpu1();
          priv->rotator_irq_cpu1 = false;
        }
    }

  priv->initialized = false;
  priv->faulted = false;
  priv->interrupts_enabled = false;
  priv->completion_isr_registered = false;
  priv->error_isr_registered = false;
  priv->driver_owned = false;
  priv->memory_owned = false;
  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

    priv->operation_active = false;
    priv->completion_done = false;
    priv->engine = BK7258_SCALE_ROTATE_SCALE0;
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }

out:
  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_scale(FAR struct bk7258_scale_rotate_s *priv,
                 FAR const struct bk7258_scale_request_s *request)
{
  scale_drv_config_t config;
  pixel_format_t format;
  clock_t ticks;
  uint64_t src_need;
  uint64_t dst_need;
  int pixel_bytes;
  int ret;

  if (request == NULL || priv != &g_bk7258_scale_rotate)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_scale_rotate_check(priv, priv->engine);
  if (ret < 0 || !bk7258_scale_rotate_is_scale(priv->engine))
    {
      ret = ret < 0 ? ret : -ENOTSUP;
      goto out;
    }

  pixel_bytes = bk7258_scale_rotate_pixel_bytes(request->format);
  ret = bk7258_scale_rotate_map_scale_format(request->format, &format);
  if (ret < 0)
    {
      goto out;
    }

  if (pixel_bytes < 0 || request->src_width == 0 ||
      request->src_height == 0 || request->dst_width == 0 ||
      request->dst_height == 0 || request->src_width > BK7258_SCALE_ROTATE_MAX_DIM ||
      request->src_height > BK7258_SCALE_ROTATE_MAX_DIM ||
      request->dst_width > BK7258_SCALE_ROTATE_MAX_DIM ||
      request->dst_height > BK7258_SCALE_ROTATE_MAX_DIM ||
      /* v3.1.1.9 has an inverted 8-pixel branch in
       * scale_set_write_burst(), and hw_scale_frame() discards its error.
       * Multiples of 16 take a correct branch and are the smallest width
       * this wrapper can expose without modifying the SDK. */

      (request->dst_width & 15) != 0)
    {
      ret = -EINVAL;
      goto out;
    }

  src_need = (uint64_t)request->src_width * request->src_height * pixel_bytes;
  dst_need = (uint64_t)request->dst_width * request->dst_height * pixel_bytes;
  if (src_need > request->src_size || dst_need > request->dst_size)
    {
      ret = -EINVAL;
      goto out;
    }

  ret = bk7258_scale_rotate_validate_buffer(request->src, request->src_size);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_validate_buffer(request->dst, request->dst_size);
  if (ret < 0)
    {
      goto out;
    }

  if (bk7258_scale_rotate_ranges_overlap(request->src, request->src_size,
                                         request->dst, request->dst_size))
    {
      ret = -EINVAL;
      goto out;
    }

