open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_scale_rotate.c
  memset(&config, 0, sizeof(config));
  config.line_cycle = BK7258_SCALE_ROTATE_FRAME_LINE_CYCLE;
  config.line_mask = BK7258_SCALE_ROTATE_FRAME_LINE_MASK;
  config.src_width = request->src_width;
  config.src_height = request->src_height;
  config.dst_width = request->dst_width;
  config.dst_height = request->dst_height;
  config.scale_mode = FRAME_SCALE;
  config.pixel_fmt = format;
  config.src_addr = (FAR uint8_t *)request->src;
  config.dst_addr = request->dst;

  if (priv->engine == BK7258_SCALE_ROTATE_SCALE1)
    {
      bk7258_scale_rotate_configure_scale1_burst(request->dst_width);
    }

  ret = bk7258_scale_rotate_prepare_wait_locked(priv, request->timeout_ms,
                                                &ticks);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_sdk_error(hw_scale_frame(
    bk7258_scale_rotate_scale_id(priv->engine), &config));
  if (ret < 0)
    {
      irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

      priv->operation_active = false;
      priv->completion_done = false;
      spin_unlock_irqrestore(&priv->state_lock, flags);
      priv->faulted = true;
      goto out;
    }

  ret = bk7258_scale_rotate_wait_locked(priv, ticks);

out:
  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_rotate(FAR struct bk7258_scale_rotate_s *priv,
                  FAR const struct bk7258_rotate_request_s *request)
{
  rott_config_t config;
  pixel_format_t format;
  media_rotate_t angle;
  rott_input_data_flow_t input_flow;
  rott_output_data_flow_t output_flow;
  uint16_t output_width;
  uint16_t output_height;
  uint64_t src_need;
  uint64_t dst_need;
  clock_t ticks;
  int ret;

  if (request == NULL || priv != &g_bk7258_scale_rotate)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_scale_rotate_check(priv, priv->engine);
  if (ret < 0 || priv->engine != BK7258_SCALE_ROTATE_ROTATOR)
    {
      ret = ret < 0 ? ret : -ENOTSUP;
      goto out;
    }

  ret = bk7258_scale_rotate_map_rotate_format(request->format, &format);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_map_angle(request->angle, &angle);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_map_input_flow(request->input_flow, &input_flow);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_map_output_flow(request->output_flow,
                                            &output_flow);
  if (ret < 0)
    {
      goto out;
    }

  if (request->src_width == 0 || request->src_height == 0 ||
      request->block_width < BK7258_SCALE_ROTATE_MIN_BLOCK_PIXELS ||
      request->block_height < BK7258_SCALE_ROTATE_MIN_BLOCK_PIXELS ||
      (uint32_t)request->block_width * request->block_height >
        BK7258_SCALE_ROTATE_MAX_BLOCK_PIXELS ||
      request->src_width % request->block_width != 0 ||
      request->src_height % request->block_height != 0 ||
      request->block_count !=
        (uint32_t)(request->src_width / request->block_width) *
        (request->src_height / request->block_height) ||
      (request->watermark_block != 0 &&
       request->watermark_block >= request->block_count))
    {
      ret = -EINVAL;
      goto out;
    }

  output_width = request->angle == BK7258_SCALE_ROTATE_NONE ?
    request->src_width : request->src_height;
  output_height = request->angle == BK7258_SCALE_ROTATE_NONE ?
    request->src_height : request->src_width;
  src_need = (uint64_t)request->src_width * request->src_height * 2;
  dst_need = (uint64_t)output_width * output_height * 2;
  if (src_need > request->src_size || dst_need > request->dst_size)
    {
      ret = -EINVAL;
      goto out;
    }

  ret = bk7258_scale_rotate_validate_buffer(request->src, request->src_size);
  if (ret < 0)
    {
      goto out;
    }

  ret = bk7258_scale_rotate_validate_buffer(request->dst, request->dst_size);
  if (ret < 0)
    {
      goto out;
    }

  if (bk7258_scale_rotate_ranges_overlap(request->src, request->src_size,
                                         request->dst, request->dst_size))
    {
      ret = -EINVAL;
      goto out;
    }

  memset(&config, 0, sizeof(config));
  config.rot_mode = angle;
  config.input_addr = (FAR void *)request->src;
  config.output_addr = request->dst;
  config.input_fmt = format;
  config.input_flow = input_flow;
  config.output_flow = output_flow;
  config.picture_xpixel = request->src_width;
  config.picture_ypixel = request->src_height;
  config.block_xpixel = request->block_width;
  config.block_ypixel = request->block_height;
  config.block_cnt = request->block_count;
  config.watermark_blk = request->watermark_block;

  ret = bk7258_scale_rotate_sdk_error(rott_config(&config));
  if (ret < 0)
    {
      priv->faulted = true;
      goto out;
    }

  /* v3.1.1.9 rott_config leaves the input/output flow fields unused in its
   * implementation.  Apply the same public settings explicitly. */

  ret = bk7258_scale_rotate_sdk_error(
    bk_rott_data_reverse(input_flow, output_flow));
  if (ret >= 0)
    {
      ret = bk7258_scale_rotate_prepare_wait_locked(priv,
                                                    request->timeout_ms,
                                                    &ticks);
    }

  if (ret >= 0)
    {
      ret = bk7258_scale_rotate_sdk_error(bk_rott_enable());
    }

  if (ret >= 0)
    {
      ret = bk7258_scale_rotate_wait_locked(priv, ticks);
    }

  if (ret < 0)
    {
      irqstate_t flags = spin_lock_irqsave(&priv->state_lock);

      priv->operation_active = false;
      priv->completion_done = false;
      spin_unlock_irqrestore(&priv->state_lock, flags);
      priv->faulted = true;
    }

out:
  nxmutex_unlock(&priv->lock);
  return ret;
}
